NaN (Not a number)

None(for object data types)

isnull()
True---Nan is missing
False--value is present

In [1]:
import pandas as pd

In [2]:
data = {
    "Name": [
        "Amit", None, "Rahul", "Pooja", None,
        "Anjali", "Rohit", "Sneha", "Karan", "Priya"
    ],
    "Age": [
        25,  None, 30, 24,  None,
        27, 32, 26, 29, 31
    ],
    "Salary": [
        35000, None, 55000, 30000,  None,
        48000, 60000, 40000, 52000, 58000
    ],
    "Performance_Score": [
        78, None, 90, 72,  None,
        82, 91, 80, 86, 89
    ]
}

df=pd.DataFrame(data)
print(df)

     Name   Age   Salary  Performance_Score
0    Amit  25.0  35000.0               78.0
1    None   NaN      NaN                NaN
2   Rahul  30.0  55000.0               90.0
3   Pooja  24.0  30000.0               72.0
4    None   NaN      NaN                NaN
5  Anjali  27.0  48000.0               82.0
6   Rohit  32.0  60000.0               91.0
7   Sneha  26.0  40000.0               80.0
8   Karan  29.0  52000.0               86.0
9   Priya  31.0  58000.0               89.0

In [3]:
print(df.isnull())

    Name    Age  Salary  Performance_Score
0  False  False   False              False
1   True   True    True               True
2  False  False   False              False
3  False  False   False              False
4   True   True    True               True
5  False  False   False              False
6  False  False   False              False
7  False  False   False              False
8  False  False   False              False
9  False  False   False              False

In [4]:
#dropna----clear none values
#axis=0  --drop rows of missing value while 1 will drop colums
df.dropna(axis=0,inplace=True)
print(df)

     Name   Age   Salary  Performance_Score
0    Amit  25.0  35000.0               78.0
2   Rahul  30.0  55000.0               90.0
3   Pooja  24.0  30000.0               72.0
5  Anjali  27.0  48000.0               82.0
6   Rohit  32.0  60000.0               91.0
7   Sneha  26.0  40000.0               80.0
8   Karan  29.0  52000.0               86.0
9   Priya  31.0  58000.0               89.0

In [5]:
data = {
    "Name": [
        "Amit", None, "Rahul", "Pooja", None,
        "Anjali", "Rohit", "Sneha", "Karan", "Priya"
    ],
    "Age": [
        25,  None, 30, 24,  None,
        27, 32, 26, 29, 31
    ],
    "Salary": [
        35000, None, 55000, 30000,  None,
        48000, 60000, 40000, 52000, 58000
    ],
    "Performance_Score": [
        78, None, 90, 72,  None,
        82, 91, 80, 86, 89
    ]
}

df=pd.DataFrame(data)
print(df)

     Name   Age   Salary  Performance_Score
0    Amit  25.0  35000.0               78.0
1    None   NaN      NaN                NaN
2   Rahul  30.0  55000.0               90.0
3   Pooja  24.0  30000.0               72.0
4    None   NaN      NaN                NaN
5  Anjali  27.0  48000.0               82.0
6   Rohit  32.0  60000.0               91.0
7   Sneha  26.0  40000.0               80.0
8   Karan  29.0  52000.0               86.0
9   Priya  31.0  58000.0               89.0

In [6]:
#fillna(default_value,inplace=True)
#fill the none value

df.fillna(0,inplace=True)
print(df)

     Name   Age   Salary  Performance_Score
0    Amit  25.0  35000.0               78.0
1       0   0.0      0.0                0.0
2   Rahul  30.0  55000.0               90.0
3   Pooja  24.0  30000.0               72.0
4       0   0.0      0.0                0.0
5  Anjali  27.0  48000.0               82.0
6   Rohit  32.0  60000.0               91.0
7   Sneha  26.0  40000.0               80.0
8   Karan  29.0  52000.0               86.0
9   Priya  31.0  58000.0               89.0

In [8]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

print(df)

     Name   Age   Salary  Performance_Score
0    Amit  25.0  35000.0               78.0
1       0   0.0      0.0                0.0
2   Rahul  30.0  55000.0               90.0
3   Pooja  24.0  30000.0               72.0
4       0   0.0      0.0                0.0
5  Anjali  27.0  48000.0               82.0
6   Rohit  32.0  60000.0               91.0
7   Sneha  26.0  40000.0               80.0
8   Karan  29.0  52000.0               86.0
9   Priya  31.0  58000.0               89.0